src/hibari/images-src/read-write-path-3-repair.dot
//
// Copyright (c) 2005-2011 Gemini Mobile Technologies, Inc.  All rights reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

digraph data_flow {
    //nodesep = 0.5;
    CLIENT1 [label="Client1"];
    CLIENT2 [label="Client2"];
    HEAD [label="Head Brick"];
    MIDDLE [label="Middle Brick\n+Official Tail"];
    TAIL [label="Tail Brick"];
    {rank=same; CLIENT1 CLIENT2};
    {rank=same; HEAD MIDDLE TAIL};

    CLIENT1 -> HEAD [label="Update request"];
    HEAD -> MIDDLE [label="Replication"];
    MIDDLE -> CLIENT1 [label="Update reply"];
    MIDDLE -> TAIL [label="Replication"];
    MIDDLE -> TAIL [label="Repair"];
    TAIL -> MIDDLE [label="Repair"];
    CLIENT2 -> MIDDLE [label="Read request"];
    MIDDLE -> CLIENT2 [label="Read reply"];
};
